"""
Константы игры.
Содержит размеры окна, цвета, параметры волны, матрицу лабиринта и параметры игровых объектов.
"""

#размеры окна и сетки
WINDOW_WIDTH = 800
WINDOW_HEIGHT = 600
FPS = 60

TILE_SIZE = 40 #размер одной клетки в пикселях
GRID_COLUMNS = WINDOW_WIDTH // TILE_SIZE #  сколько клеток помещается по горизонтали/вертикали. 20
GRID_ROWS = WINDOW_HEIGHT // TILE_SIZE   #// целочисленное деление. 15

# параметры звуковой волны
WAVE_SPEED = 4.0 # на сколько пикселей за один кадр расширяется волна
WAVE_MAX_RADIUS = 250 # максимальный радиус волны
WAVE_THICKNESS = 5 # толщина кольца подсветки

# сколько альфа единиц потухает за кадр
# ALPHA_DECAY = 8 убрала для лаб 2

# параметры игрока
PLAYER_SIZE = 16
PLAYER_SPEED = 3

# параметры врагов
ENEMY_SIZE = 20
ENEMY_SPEED = 1.2

COLORS = {
    "bg": (0, 0, 0),             # фон чёрный
    "wall": (0, 200, 255),       # цвет контура стен при подсветке
    "enemy": (255, 60, 60),      # цвет врагов при подсветке
    "player": (0, 0, 0),         # игрок невидим, под цвет фона
    "wave": (0, 255, 180),       # голубая волна
    "text": (200, 200, 200),     # мягкий белый
    "menu_title": (0, 255, 180), # аквамариновый
}
# лабиринт (убрала для 2 лабф)
# 1 - стена, 0 - пустое пространство, 2 - выигрыш
"""
LEVEL_MATRIX = [
    [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
    [1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1],
    [1, 0, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1],
    [1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1],
    [1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1],
    [1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1],
    [1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1],
    [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1],
    [1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1],
    [1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1],
    [1, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1],
    [1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1],
    [1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 1],
    [1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1],
    [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 1],
]
    """


# стартовые позиции
PLAYER_START = (60, 60)

ENEMY_POSITIONS = [
    (360, 200),
    (600, 440),
    (240, 440),
    (680, 120),
]

# текстовые сообщения
GAME_MESSAGES = {
    "title": "ЭХО-ЛОКАТОР",
    "subtitle": "Echo Radar",
    "menu_hint": "Нажмите ПРОБЕЛ для старта",
    "controls": "Стрелки / WASD — движение, ПРОБЕЛ — импульс, R — рестарт",
    "win": "ВЫ ВЫБРАЛИСЬ!",
    "lose": "ВАС ОБНАРУЖИЛИ!",
    "restart": "Нажмите R для возврата в меню",
}